[Killed] BlockStatement
src/delegate_generator.js:1:26
-function* subGenerator() {
-    yield "A";
-    yield "B";
-}
+function* subGenerator() {}
 
 function* mainGenerator() {
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose

  console.log
    [ 1, 3 ]

[Killed] StringLiteral
src/delegate_generator.js:2:11
 function* subGenerator() {
-    yield "A";
+    yield "";
     yield "B";
 }
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


  console.log
    [ 1, '', 'B', 3 ]

[Killed] BlockStatement
src/delegate_generator.js:6:27
     yield "B";
 }
 
-function* mainGenerator() {
-    yield 1;
-    yield* subGenerator(); // Delegate to subGenerator
-    yield 3;
-}
+function* mainGenerator() {}
 
 const gen = mainGenerator();
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


  console.log
    []
