[Killed] BlockStatement
src/generator.js:1:25
-function* myGenerator() {
-  yield 1;
-  yield 2;
-  yield 3;
-}
+function* myGenerator() {}
 
 module.exports = { myGenerator };
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


  console.log
    [ 1, 'A', 'B', 3 ]
