[Survived] BlockStatement
src/infininite_sequence.js:1:29
-function* infiniteNumbers() {
-    let i = 0;
-    while (true) {
-        yield i++; // Pause and return the current value
-    }
-}
+function* infiniteNumbers() {}
 
 const numbers = infiniteNumbers();

[Survived] BooleanLiteral
src/infininite_sequence.js:3:12
 function* infiniteNumbers() {
     let i = 0;
-    while (true) {
+    while (false) {
         yield i++; // Pause and return the current value
     }

[Survived] UpdateOperator
src/infininite_sequence.js:4:15
 function* infiniteNumbers() {
     let i = 0;
     while (true) {
-        yield i++; // Pause and return the current value
+        yield i--; // Pause and return the current value
     }
 }

[Survived] ObjectLiteral
src/infininite_sequence.js:10:18
 
 const numbers = infiniteNumbers();
 
-module.exports = { infiniteNumbers };
+module.exports = {};
 
