[Killed] BlockStatement
src/sequence_generator.js:1:40
-function* generateSequence(start, end) {
-    for (let i = start; i <= end; i++) {
-        yield i; // Pause and return the current value
-    }
-}
+function* generateSequence(start, end) {}
 
 const sequence = generateSequence(1, 5);
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


PASS test/generator.test.js

  myGenerator

[Killed] EqualityOperator
src/sequence_generator.js:2:25
 function* generateSequence(start, end) {
-    for (let i = start; i <= end; i++) {
+    for (let i = start; i < end; i++) {
         yield i; // Pause and return the current value
     }
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


  console.log
    1

[Killed] BlockStatement
src/sequence_generator.js:2:40
 function* generateSequence(start, end) {
-    for (let i = start; i <= end; i++) {
-        yield i; // Pause and return the current value
-    }
+    for (let i = start; i <= end; i++) {}
 }
 
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


FAIL test/sequence_generator.test.js

  generateSequence

[Survived] BlockStatement
src/sequence_generator.js:9:31
 
 const sequence = generateSequence(1, 5);
 
-for (const value of sequence) {
-    console.log(value); // Logs 1, 2, 3, 4, 5
-}
+for (const value of sequence) {}
 
 

[Killed] ObjectLiteral
src/sequence_generator.js:14:18
 }
 
 
-module.exports = { generateSequence };
+module.exports = {};
 
 
killedBy: All tests
statusReason: > regular_functions@1.0.0 test
> jest --verbose


  console.log
    1
