[Timeout] ConditionalExpression
src/areacalculator.js:6:9
 const calculateArea = (choice,side,length,breadth,radius) =>{   
     let area = 0.0; 
     switch (choice) {
-        case 'circle':
-            {
-                if (radius!=null) {
-                    area=3.14*radius*radius;
-                }
-                else{
-                    area=-1;
-                }
-
-            break;
-
-            }
+        case 'circle':
             case 'square':
                 {

[Timeout] BlockStatement
src/areacalculator.js:7:13
     let area = 0.0; 
     switch (choice) {
         case 'circle':
-            {
-                if (radius!=null) {
-                    area=3.14*radius*radius;
-                }
-                else{
-                    area=-1;
-                }
-
-            break;
-
-            }
+            {}
             case 'square':
                 {

[Timeout] ConditionalExpression
src/areacalculator.js:8:21
     switch (choice) {
         case 'circle':
             {
-                if (radius!=null) {
+                if (false) {
                     area=3.14*radius*radius;
                 }

[Timeout] EqualityOperator
src/areacalculator.js:8:21
     switch (choice) {
         case 'circle':
             {
-                if (radius!=null) {
+                if (radius == null) {
                     area=3.14*radius*radius;
                 }

[Timeout] ArithmeticOperator
src/areacalculator.js:9:26
         case 'circle':
             {
                 if (radius!=null) {
-                    area=3.14*radius*radius;
+                    area=3.14 * radius / radius;
                 }
                 else{

[Timeout] ArithmeticOperator
src/areacalculator.js:9:26
         case 'circle':
             {
                 if (radius!=null) {
-                    area=3.14*radius*radius;
+                    area=3.14 / radius*radius;
                 }
                 else{

[Timeout] BlockStatement
src/areacalculator.js:11:21
                 if (radius!=null) {
                     area=3.14*radius*radius;
                 }
-                else{
-                    area=-1;
-                }
+                else{}
 
             break;

[Timeout] UnaryOperator
src/areacalculator.js:12:26
                     area=3.14*radius*radius;
                 }
                 else{
-                    area=-1;
+                    area=+1;
                 }
 

[Timeout] ConditionalExpression
src/areacalculator.js:18:13
             break;
 
             }
-            case 'square':
-                {
-                if(side !=null)
-                {
-                    area=4*side;
-                }
-                else{
-                    area=-1;
-                }
-                break;
-    
-                }
+            case 'square':
                 case 'rectangle':
             {

[Timeout] StringLiteral
src/areacalculator.js:18:18
             break;
 
             }
-            case 'square':
+            case "":
                 {
                 if(side !=null)

[Timeout] BlockStatement
src/areacalculator.js:19:17
 
             }
             case 'square':
-                {
-                if(side !=null)
-                {
-                    area=4*side;
-                }
-                else{
-                    area=-1;
-                }
-                break;
-    
-                }
+                {}
                 case 'rectangle':
             {

[Timeout] ConditionalExpression
src/areacalculator.js:20:20
             }
             case 'square':
                 {
-                if(side !=null)
+                if(true)
                 {
                     area=4*side;

[Timeout] EqualityOperator
src/areacalculator.js:20:20
             }
             case 'square':
                 {
-                if(side !=null)
+                if(side == null)
                 {
                     area=4*side;

[Timeout] BlockStatement
src/areacalculator.js:21:17
             case 'square':
                 {
                 if(side !=null)
-                {
-                    area=4*side;
-                }
+                {}
                 else{
                     area=-1;

[Timeout] ArithmeticOperator
src/areacalculator.js:22:26
                 {
                 if(side !=null)
                 {
-                    area=4*side;
+                    area=4 / side;
                 }
                 else{

[Timeout] ConditionalExpression
src/areacalculator.js:30:17
                 break;
     
                 }
-                case 'rectangle':
-            {
-               if(length!=null && breadth!=null)
-               {
-                  area=length*breadth;
-               }
-               else{
-                area=-1;
-               }
-            break;
-
-            }   
+                case 'rectangle':   
             
     

[Timeout] StringLiteral
src/areacalculator.js:30:22
                 break;
     
                 }
-                case 'rectangle':
+                case "":
             {
                if(length!=null && breadth!=null)

[Timeout] BlockStatement
src/areacalculator.js:31:13
     
                 }
                 case 'rectangle':
-            {
-               if(length!=null && breadth!=null)
-               {
-                  area=length*breadth;
-               }
-               else{
-                area=-1;
-               }
-            break;
-
-            }   
+            {}   
             
     

[Timeout] EqualityOperator
src/areacalculator.js:32:35
                 }
                 case 'rectangle':
             {
-               if(length!=null && breadth!=null)
+               if(length!=null && breadth == null)
                {
                   area=length*breadth;

[Timeout] ConditionalExpression
src/areacalculator.js:32:35
                 }
                 case 'rectangle':
             {
-               if(length!=null && breadth!=null)
+               if(length!=null && true)
                {
                   area=length*breadth;

[Timeout] BlockStatement
src/areacalculator.js:33:16
                 case 'rectangle':
             {
                if(length!=null && breadth!=null)
-               {
-                  area=length*breadth;
-               }
+               {}
                else{
                 area=-1;

[Timeout] ArithmeticOperator
src/areacalculator.js:34:24
             {
                if(length!=null && breadth!=null)
                {
-                  area=length*breadth;
+                  area=length / breadth;
                }
                else{

[Timeout] ConditionalExpression
src/areacalculator.js:44:9
             }   
             
     
-        default:
-            area=-1;
-            break;
+        default:
     }
     // write logic here

[Timeout] UnaryOperator
src/areacalculator.js:45:18
             
     
         default:
-            area=-1;
+            area=+1;
             break;
     }

[Timeout] ObjectLiteral
src/areacalculator.js:52:18
     // note that you check the values passed are not null before performing any operation on them
     return area
 }
-module.exports = {calculateArea}
+module.exports = {}
 
