[Timeout] BlockStatement
src/category.js:1:39
-var category = function category(key) {
-  if (key=="EL" || key=="eL" || key=="El" || key=="el") {
-    return "Education Loan";
-  }
-  else if (key=="PL" || key=="pL" || key=="Pl" || key=="pl") {
-    return "Personal Loan";
-  }
-  else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
-    return "Vehicle Loan";
-  }
-  else if (key=="HL" || key=="hL" || key=="Hl" || key=="hl") {
-    return "Home Loan";
-  }
-
-  };
+var category = function category(key) {};
   
   module.exports = {

[Timeout] EqualityOperator
src/category.js:2:46
 var category = function category(key) {
-  if (key=="EL" || key=="eL" || key=="El" || key=="el") {
+  if (key=="EL" || key=="eL" || key=="El" || key != "el") {
     return "Education Loan";
   }

[Timeout] EqualityOperator
src/category.js:2:33
 var category = function category(key) {
-  if (key=="EL" || key=="eL" || key=="El" || key=="el") {
+  if (key=="EL" || key=="eL" || key != "El" || key=="el") {
     return "Education Loan";
   }

[Timeout] LogicalOperator
src/category.js:5:12
   if (key=="EL" || key=="eL" || key=="El" || key=="el") {
     return "Education Loan";
   }
-  else if (key=="PL" || key=="pL" || key=="Pl" || key=="pl") {
+  else if ((key == "PL" || key == "pL") && key == "Pl" || key=="pl") {
     return "Personal Loan";
   }

[Timeout] ConditionalExpression
src/category.js:5:12
   if (key=="EL" || key=="eL" || key=="El" || key=="el") {
     return "Education Loan";
   }
-  else if (key=="PL" || key=="pL" || key=="Pl" || key=="pl") {
+  else if (false) {
     return "Personal Loan";
   }

[Timeout] LogicalOperator
src/category.js:8:12
   else if (key=="PL" || key=="pL" || key=="Pl" || key=="pl") {
     return "Personal Loan";
   }
-  else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
+  else if ((key == "VL" || key == "vL") && key == "Vl" || key=="vl") {
     return "Vehicle Loan";
   }

[Timeout] EqualityOperator
src/category.js:8:51
   else if (key=="PL" || key=="pL" || key=="Pl" || key=="pl") {
     return "Personal Loan";
   }
-  else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
+  else if (key=="VL" || key=="vL" || key=="Vl" || key != "vl") {
     return "Vehicle Loan";
   }

[Timeout] StringLiteral
src/category.js:9:12
     return "Personal Loan";
   }
   else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
-    return "Vehicle Loan";
+    return "";
   }
   else if (key=="HL" || key=="hL" || key=="Hl" || key=="hl") {

[Timeout] EqualityOperator
src/category.js:11:12
   else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
     return "Vehicle Loan";
   }
-  else if (key=="HL" || key=="hL" || key=="Hl" || key=="hl") {
+  else if (key != "HL" || key=="hL" || key=="Hl" || key=="hl") {
     return "Home Loan";
   }

[Timeout] EqualityOperator
src/category.js:11:25
   else if (key=="VL" || key=="vL" || key=="Vl" || key=="vl") {
     return "Vehicle Loan";
   }
-  else if (key=="HL" || key=="hL" || key=="Hl" || key=="hl") {
+  else if (key=="HL" || key != "hL" || key=="Hl" || key=="hl") {
     return "Home Loan";
   }

[Timeout] StringLiteral
src/category.js:12:12
     return "Vehicle Loan";
   }
   else if (key=="HL" || key=="hL" || key=="Hl" || key=="hl") {
-    return "Home Loan";
+    return "";
   }
 
