[Timeout] ArrayDeclaration
src/customer.js:1:18
-var customerList=[];
+var customerList=["Stryker was here"];
 
 const addCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{

[Timeout] BooleanLiteral
src/customer.js:5:21
 
 const addCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
       // Write the Logic here
-      let isAlready=false;
+      let isAlready=true;
       
       if(customerList.length==0)

[Timeout] EqualityOperator
src/customer.js:7:10
       // Write the Logic here
       let isAlready=false;
       
-      if(customerList.length==0)
+      if(customerList.length != 0)
       {
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category])

[Timeout] ConditionalExpression
src/customer.js:7:10
       // Write the Logic here
       let isAlready=false;
       
-      if(customerList.length==0)
+      if(true)
       {
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category])

[Timeout] BlockStatement
src/customer.js:8:7
       let isAlready=false;
       
       if(customerList.length==0)
-      {
-            customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category])
-          
-      }
+      {}
       else{
            for (let index = 0; index < customerList.length; index++) {

[Timeout] BlockStatement
src/customer.js:12:11
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category])
           
       }
-      else{
-           for (let index = 0; index < customerList.length; index++) {
-           if (customerList[index][0]==CustomerId) {
-            isAlready=true;
-                
-           }
-            
-           }
-           if (!isAlready) {
-            customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category]);
-           
-           
-           }
-      }
+      else{}
       
       

[Timeout] BlockStatement
src/customer.js:13:70
           
       }
       else{
-           for (let index = 0; index < customerList.length; index++) {
-           if (customerList[index][0]==CustomerId) {
-            isAlready=true;
-                
-           }
-            
-           }
+           for (let index = 0; index < customerList.length; index++) {}
            if (!isAlready) {
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category]);

[Timeout] EqualityOperator
src/customer.js:13:32
           
       }
       else{
-           for (let index = 0; index < customerList.length; index++) {
+           for (let index = 0; index <= customerList.length; index++) {
            if (customerList[index][0]==CustomerId) {
             isAlready=true;

[Timeout] ConditionalExpression
src/customer.js:14:16
       }
       else{
            for (let index = 0; index < customerList.length; index++) {
-           if (customerList[index][0]==CustomerId) {
+           if (true) {
             isAlready=true;
                 

[Timeout] BlockStatement
src/customer.js:14:52
       }
       else{
            for (let index = 0; index < customerList.length; index++) {
-           if (customerList[index][0]==CustomerId) {
-            isAlready=true;
-                
-           }
+           if (customerList[index][0]==CustomerId) {}
             
            }

[Timeout] BooleanLiteral
src/customer.js:15:23
       else{
            for (let index = 0; index < customerList.length; index++) {
            if (customerList[index][0]==CustomerId) {
-            isAlready=true;
+            isAlready=false;
                 
            }

[Timeout] BooleanLiteral
src/customer.js:20:16
            }
             
            }
-           if (!isAlready) {
+           if (isAlready) {
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category]);
            

[Timeout] ConditionalExpression
src/customer.js:20:16
            }
             
            }
-           if (!isAlready) {
+           if (false) {
             customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category]);
            

[Timeout] ArrayDeclaration
src/customer.js:21:31
             
            }
            if (!isAlready) {
-            customerList.push([CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category]);
+            customerList.push([]);
            
            

[Timeout] BlockStatement
src/customer.js:30:109
       
 }
 
-const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
-      // Write the Logic here
-     for (let index = 0; index < customerList.length; index++) {
-      if (customerList[index][0]==CustomerId) {
-            customerList[index][1]=CustomerName;
-            customerList[index][2]=CustomerAge;
-            customerList[index][3]=CustomerAddress;
-            customerList[index][4]= CustomerContactNumber;
-            customerList[index][5]=Category;
-      }
-      
-     }
-
- 
-}
+const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{}
 
 const getAllCustomers=()=>{

[Timeout] BlockStatement
src/customer.js:32:64
 
 const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
       // Write the Logic here
-     for (let index = 0; index < customerList.length; index++) {
-      if (customerList[index][0]==CustomerId) {
-            customerList[index][1]=CustomerName;
-            customerList[index][2]=CustomerAge;
-            customerList[index][3]=CustomerAddress;
-            customerList[index][4]= CustomerContactNumber;
-            customerList[index][5]=Category;
-      }
-      
-     }
+     for (let index = 0; index < customerList.length; index++) {}
 
  

[Timeout] EqualityOperator
src/customer.js:32:26
 
 const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
       // Write the Logic here
-     for (let index = 0; index < customerList.length; index++) {
+     for (let index = 0; index <= customerList.length; index++) {
       if (customerList[index][0]==CustomerId) {
             customerList[index][1]=CustomerName;

[Timeout] BlockStatement
src/customer.js:33:47
 const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
       // Write the Logic here
      for (let index = 0; index < customerList.length; index++) {
-      if (customerList[index][0]==CustomerId) {
-            customerList[index][1]=CustomerName;
-            customerList[index][2]=CustomerAge;
-            customerList[index][3]=CustomerAddress;
-            customerList[index][4]= CustomerContactNumber;
-            customerList[index][5]=Category;
-      }
+      if (customerList[index][0]==CustomerId) {}
       
      }

[Timeout] EqualityOperator
src/customer.js:33:11
 const updateCustomer=(CustomerId, CustomerName,CustomerAge,CustomerAddress,CustomerContactNumber,Category)=>{
       // Write the Logic here
      for (let index = 0; index < customerList.length; index++) {
-      if (customerList[index][0]==CustomerId) {
+      if (customerList[index][0] != CustomerId) {
             customerList[index][1]=CustomerName;
             customerList[index][2]=CustomerAge;

[Timeout] BlockStatement
src/customer.js:46:27
  
 }
 
-const getAllCustomers=()=>{
-  // Write the Logic here
-  return customerList;
-}
+const getAllCustomers=()=>{}
 
 module.exports={addCustomer,updateCustomer,getAllCustomers}
