[Timeout] ArrowFunction
src/LodashExample.js:7:20
 
 
 //Create a function to find a maximum value from number array.
-const findMaxValue=(arr) => lodash.max(arr);
+const findMaxValue=() => undefined;
 
 

[Timeout] MethodExpression
src/LodashExample.js:7:29
 
 
 //Create a function to find a maximum value from number array.
-const findMaxValue=(arr) => lodash.max(arr);
+const findMaxValue=(arr) => lodash.min(arr);
 
 

[Timeout] BlockStatement
src/LodashExample.js:12:32
 
 //Create a function to return all values from numbers array 
 //which are greater than the second parameter./​
-const filterValues=(arr, num)=>{
-  let newArray=new Array();
- for (let index = 0; index < arr.length; index++) {
-  
-  if (arr[index]>num) {
-    newArray.push(arr[index]);
-    
-  }
- }
- return newArray;
-}
+const filterValues=(arr, num)=>{}
 
 //Create a function to return all values of employeeName array in capital letters.

[Timeout] EqualityOperator
src/LodashExample.js:14:22
 //which are greater than the second parameter./​
 const filterValues=(arr, num)=>{
   let newArray=new Array();
- for (let index = 0; index < arr.length; index++) {
+ for (let index = 0; index >= arr.length; index++) {
   
   if (arr[index]>num) {

[Timeout] UpdateOperator
src/LodashExample.js:14:42
 //which are greater than the second parameter./​
 const filterValues=(arr, num)=>{
   let newArray=new Array();
- for (let index = 0; index < arr.length; index++) {
+ for (let index = 0; index < arr.length; index--) {
   
   if (arr[index]>num) {

[Timeout] ConditionalExpression
src/LodashExample.js:16:7
   let newArray=new Array();
  for (let index = 0; index < arr.length; index++) {
   
-  if (arr[index]>num) {
+  if (true) {
     newArray.push(arr[index]);
     

[Timeout] BlockStatement
src/LodashExample.js:16:23
   let newArray=new Array();
  for (let index = 0; index < arr.length; index++) {
   
-  if (arr[index]>num) {
-    newArray.push(arr[index]);
-    
-  }
+  if (arr[index]>num) {}
  }
  return newArray;

[Timeout] BlockStatement
src/LodashExample.js:25:35
 }
 
 //Create a function to return all values of employeeName array in capital letters.
-const nameInCapital= (employees)=>{
-  return employees.map(x=> x.toUpperCase());
-}
+const nameInCapital= (employees)=>{}
 
 

[Timeout] MethodExpression
src/LodashExample.js:26:28
 
 //Create a function to return all values of employeeName array in capital letters.
 const nameInCapital= (employees)=>{
-  return employees.map(x=> x.toUpperCase());
+  return employees.map(x=> x.toLowerCase());
 }
 

[Timeout] ArrowFunction
src/LodashExample.js:26:24
 
 //Create a function to return all values of employeeName array in capital letters.
 const nameInCapital= (employees)=>{
-  return employees.map(x=> x.toUpperCase());
+  return employees.map(() => undefined);
 }
 

[Timeout] ObjectLiteral
src/LodashExample.js:31:18
 
 
 
-module.exports = {
-  findMaxValue,
-  filterValues,
-  nameInCapital,
-  
-}
+module.exports = {}
 
