[Timeout] ArithmeticOperator
src/SimpleCalculator.js:6:33
 //Create function addNumbers which will take two parameters add the numbers 
 //and return the result
 
-const addNumbers=(num1, num2)=> num1+num2;
+const addNumbers=(num1, num2)=> num1 - num2;
 
 

[Timeout] ArrowFunction
src/SimpleCalculator.js:6:18
 //Create function addNumbers which will take two parameters add the numbers 
 //and return the result
 
-const addNumbers=(num1, num2)=> num1+num2;
+const addNumbers=() => undefined;
 
 

[Timeout] ArithmeticOperator
src/SimpleCalculator.js:11:33
 
 //Create function subNumbers which will take two parameters subtract the numbers 
 //and return the result
-const subNumbers=(num1, num2)=> num1-num2;
+const subNumbers=(num1, num2)=> num1 + num2;
 
 //Create function mulNumbers which will take two parameters multiply the numbers 

[Timeout] ArrowFunction
src/SimpleCalculator.js:11:18
 
 //Create function subNumbers which will take two parameters subtract the numbers 
 //and return the result
-const subNumbers=(num1, num2)=> num1-num2;
+const subNumbers=() => undefined;
 
 //Create function mulNumbers which will take two parameters multiply the numbers 

[Timeout] ArithmeticOperator
src/SimpleCalculator.js:15:33
 
 //Create function mulNumbers which will take two parameters multiply the numbers 
 //and return the result
-const mulNumbers=(num1, num2)=> num1*num2;
+const mulNumbers=(num1, num2)=> num1 / num2;
 
 

[Timeout] ArrowFunction
src/SimpleCalculator.js:15:18
 
 //Create function mulNumbers which will take two parameters multiply the numbers 
 //and return the result
-const mulNumbers=(num1, num2)=> num1*num2;
+const mulNumbers=() => undefined;
 
 

[Timeout] BlockStatement
src/SimpleCalculator.js:20:33
 
 //Create function divNumbers which will take two parameters divide the numbers 
 //and return the result
-const divNumbers=(num1, num2)=> {
-  if(num2==0)
-  {
-    return "Please provide valid numbers..!";
-  }
-  else{
-return num1/num2;
-  }
-}
+const divNumbers=(num1, num2)=> {}
 
 

[Timeout] ConditionalExpression
src/SimpleCalculator.js:21:6
 //Create function divNumbers which will take two parameters divide the numbers 
 //and return the result
 const divNumbers=(num1, num2)=> {
-  if(num2==0)
+  if(true)
   {
     return "Please provide valid numbers..!";

[Timeout] EqualityOperator
src/SimpleCalculator.js:21:6
 //Create function divNumbers which will take two parameters divide the numbers 
 //and return the result
 const divNumbers=(num1, num2)=> {
-  if(num2==0)
+  if(num2 != 0)
   {
     return "Please provide valid numbers..!";

[Timeout] BlockStatement
src/SimpleCalculator.js:22:3
 //and return the result
 const divNumbers=(num1, num2)=> {
   if(num2==0)
-  {
-    return "Please provide valid numbers..!";
-  }
+  {}
   else{
 return num1/num2;

[Timeout] BlockStatement
src/SimpleCalculator.js:25:7
   {
     return "Please provide valid numbers..!";
   }
-  else{
-return num1/num2;
-  }
+  else{}
 }
 

[Timeout] ArithmeticOperator
src/SimpleCalculator.js:26:8
     return "Please provide valid numbers..!";
   }
   else{
-return num1/num2;
+return num1 * num2;
   }
 }

[Timeout] ObjectLiteral
src/SimpleCalculator.js:31:18
 }
 
 
-module.exports = {
-  addNumbers,
-  subNumbers,
-  mulNumbers,
-  divNumbers
-}
+module.exports = {}
