[Timeout] ArrowFunction
src/System.js:6:17
 const os= require("os");
 
 //Create a function to get the name of the operating system of host machine.​
-const getOSName=()=> os.type();
+const getOSName=() => undefined;
 
 //Create a function to get returns the number of free memory of the system in bytes.​

[Timeout] ArrowFunction
src/System.js:9:22
 const getOSName=()=> os.type();
 
 //Create a function to get returns the number of free memory of the system in bytes.​
-const getFreeMemory= ()=> os.freemem();
+const getFreeMemory= () => undefined;
 //Create a function to get the information about current user of the system.​
 const getCurrentUser=()=> os.userInfo();

[Timeout] ArrowFunction
src/System.js:11:22
 //Create a function to get returns the number of free memory of the system in bytes.​
 const getFreeMemory= ()=> os.freemem();
 //Create a function to get the information about current user of the system.​
-const getCurrentUser=()=> os.userInfo();
+const getCurrentUser=() => undefined;
 //Create a function to get the information of the hostname.
 const getHostName=()=> os.hostname();

[Timeout] ArrowFunction
src/System.js:13:19
 //Create a function to get the information about current user of the system.​
 const getCurrentUser=()=> os.userInfo();
 //Create a function to get the information of the hostname.
-const getHostName=()=> os.hostname();
+const getHostName=() => undefined;
 //Create a function to get the information about the CPU.
 const getCPUDetails=()=> os.cpus();

[Timeout] ArrowFunction
src/System.js:15:21
 //Create a function to get the information of the hostname.
 const getHostName=()=> os.hostname();
 //Create a function to get the information about the CPU.
-const getCPUDetails=()=> os.cpus();
+const getCPUDetails=() => undefined;
 
 
